Tekla Open API Reference for Tekla Structures 2025
LeaderLine.LeaderLineTypes Enumeration
 The different types of leader lines available.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LeaderLineTypes
Public Enumeration LeaderLineTypes
Members
Member name | Value | Description
Undefined | 0 |  No type defined yet (this means that the leader line isn't selected yet).
NormalLeaderLine | 1 |  The standard leader line type. Its start point and elbow points can be freely modified. The end point is read-only information.
SupportLeaderLine | 2 |  The support leader line type, used in reinforcement marks with parallel leader lines. All leader line information is read-only.
ExtensionLeaderLine | 3 |  The type for the extension leader lines (enabled by the usage of an advanced option). All leader line information is read-only.
See Also
Reference
Tekla.Structures.Drawing Namespace